#  VEZBANJE RADA U ELEMENTARNOJ I CELOBROJNOJ ARITMETICI
#
#ZADATAK 1 - 
# Два брата налазе се на удаљености d метара, крећу се истим правцем, у супротним смеровима. Први креће се
# креће равномерно брзином од v1km/h а други v2 km/h. Пас који је бржи од оба брата равномерно трчи брзином
# од vp m/s. Пас трчи од првог ка другом брату, када стигне до другог окреће се и трчи назад ка првом, када
# стигне окреће се и трчи ка другом и то понавља све док се браћа не сретну. Напиши програм који одређује
# колико је пас метара претрчао.
# Улаз: На стандардном улазу налазе се четири реална броја, сваки у посебној линији, који редом представљају
# растојање између браће изражено у m, брзине два брата изражене у km/h, редом брзина првог брата па брзина
# другог брата, и брзину пса изражену у m/s.
# Излаз: Исписује се један реалан број заокружен на две децимале који представља број метара које је пас
# претрчао.


v1=float(input("Unesi brzinu prvog  u km/h: "))/3.6
v2=float(input("Unesi brzinu drugog brata u km/h: "))/3.6
vp=float(input("Unesi brzinu psa, koj krece od prvog vbrata u m/s: "))
d=float(input("Unesi rastojanje izmedju dva brata u metrima: "))

tk=d/(v1+v2)

s=vp*tk
print("pas je presao : " + format(s,'.2f') +"m"+ " za " +format(tk,'.2f')+" sekundi")
