# Напиши програм који одређује колико у интервалу [a, b] постоји бројева дељивих бројем k.
#
# Улаз: Са стандардног улаза уносе се три цела броја, сваки у посебном реду.
# • a (0 ≤ a ≤ 109
# )
# • b (a ≤ b ≤ 109
# )
# • k (1 ≤ k ≤ 109
# )
#
# Излаз: На стандардни излаз исписати тражени цео број.
#
# Пример
# Улаз
# 30
# 53
# 5
# Излаз
# 5
# Објашњење
# Бројеви су 30, 35, 40, 45 и 50.

a = int(input("Unesi broj a :" ))
b = int(input("Unesi broj b :" ))
k = int(input("Unesi broj k :" ))

a1 = (a+k-1)//k * k
b1 = b//k * k

n = (b1-a1)/k+1

print("U intervalu od",a,"do",b,"postoji",int(n),"celih brojeva deljivih sa",k)
