# Напиши програм који проверава да ли се две даме (краљице) на шаховској табли међусобно нападају
# (краљице се нападају ако се налазе у истој врсти, истој колони или на истој дијагонали шаховске табле).
#
# Улаз: Са стандардног улаза се учитавају координате поља на којем се налази једна краљица (два броја између
# 0 и 7 раздвојена размаком) и у наредном реду координате поља на којем се налази друга краљица (поново
# два броја између 0 и 7 раздвојена размаком). Претпостављамо да се краљице налазе на различитим пољима.
#
# Излаз: На стандардни излаз исписати текст da ако се краљице нападају тј. ne у супротном.
#
# Пример 1
# Улаз
# 5 3
# 1 7
# Излаз
# da
#
# Пример 2
# Улаз
# 5 3
# 1 8
# Излаз
# ne
#
# Пример 3
# Улаз
# 4 4
# 4 6
# Излаз
# da

(x1,y1) = map(int, input("Unesi poziciju prve kraljice ").split())
(x2,y2) = map(int, input("Unesi poziciju druge kraljice ").split())


if (int(x1)==int(x2)) or (int(y1)==int(y2)) or (abs(int(x1)-int(x2))==abs(int(y1)-int(y2))):
    print("da")
else:
    print("ne")
