# Колико се молекула супорне киселине H2SO4 може направити од датог броја атома водоника H, сумпора S
# и кисеоника O?
#
# Улаз: У свакој од две линије стандардног улаза налази се цео број који представља дати број атома, редом,
# водоника, сумпора, па кисеоника.
#
# Излаз: У једној линији стандардног излаза исписати цео број који представља број могућих молекула сумпорне киселине.
#
# Пример
# Улаз
# 75
# 58
# 106
# Излаз
# 26

h = int(input("Unesi broj atoma vodonika: "))
s = int(input("Unesi broj atoma sumpora: "))
o = int(input("Unesi broj atoma kisonika: "))

minimum= min(h//2,s,o//4)
print(minimum)
