# Мирко је мали програмер који покушава да испрограмира игрицу икс-окс. Близу је завршетка, али му је
# потребна мала помоћ. Смислио је да корисник мишем одређује квадрат у који ће се његов симбол уписати.
# Поље за игру се састоји од 9 квадрата (распоређена у три врсте и три колоне) и сваки квадрат је димензије
# 100 пута 100 пиксела (укупно поље је димензије 300 пута 300 пиксела). Познат је положај пиксела на који је
# кликнуто мишем и потребно је одредити редни број квадрата у којем се тај пиксел налази. Положај пиксела је
# одређен редним бројевима (координатама) тог пиксела по хоризонтали и по вертикали, рачунајући од доњег
# левог угла поља (пиксели се броје од 1 до 300). Квадрати се броје од 1 до 9, врсту по врсту, почевши од доњег
# левог угла поља, како је приказано на следећој слици:
#
#     7 8 9
#     4 5 6
#     1 2 3
#
# Улаз: Са стандардног улаза се учитавају два цела броја (сваки у посебном реду) x и y (1 ≤ x, y ≤ 300) који
# представљају x тј. y координату пиксела на који је кликнуто мишем.
# Излаз: На стандардни излаз се исписује један број од 1 до 9 који представља редни број квадрата

x=int(input("Unesi broj piksela po x osi: "))
y=int(input("Unesi broj piksela po y osi: "))

if (x < 100) and (y < 100 ):
    print("1")
elif (x<100) and (y<200 ):
    print("4")
elif (x<100) and (y<300 ):
    print("7")
elif (x<200 and y<100 ):
    print("2")
elif (x<200 and y<200 ):
    print("5")
elif (x<200 and y<300 ):
    print("8")
elif (x<300 and y<100 ):
    print("3")
elif (x<300 and y<200 ):
    print("6")
elif (x<300 and y<200 ):
    print("9")
else:
    print("wrong input")
