# UPOREDJIVANJE ENTORKI 
#
# Два другара, Пера и Мика, су дошла у школу. Ако се за сваког зна сат, минут и секунд када је стигао, напиши
# програм који одређује који од њих је стигао пре.
#
# Улаз: Са стандардног улаза учитава се 6 целих бројева. Прво сат, минут и секунд када је стигао Пера, а затим
# сат, минут и секунд када је стигао Мика (претпоставља се да бројеви представљају исправно задата времена).
#
# Излаз: На стандардни излаз исписати једну линију текста: Pera ако је пре стигао Пера, Mika ако је пре стигао
# Мика или istovremeno ако су стигли истовремено.
#
# Пример
#
# Улаз
# 14
# 23
# 17
# 15
# 23
# 11
# Излаз
# Pera

(h1 , m1, s1) = map (int,input("Unesi Mikine sate minute sekunde u formatu hh mm ss : ").split())
(h2 , m2, s2) = map (int,input("Unesi Perine sate minute sekunde u formatu hh mm ss : ").split())

if ((h2, m2, s2) >= (h1 , m1, s1)):
    print("Pera")
else:
    print("Mika")
