# Напиши програм који одређује колико је потеза краљу на шаховској табли потребно да дође на дато поље.
# Краљ се у сваком потезу може померити за једно поље у било ком од 8 смерова (горе, доле, лево, десно и
# дијагонално).
#
# Улаз: Са стандардног улаза се учитавају четири броја између 1 и 8 (у свакој линији по два, раздвојена
# размаком). Прва два броја представљају координате полазног, а друга два броја координате долазног поља.
# Излаз: На стандардни излаз исписати један цео број који представља најмањи број потеза потребан краљу
# да са полазног стигне до долазног поља.
#
# Пример 1
# Улаз
# 1 2
# 3 4
# Излаз
# 2
#
# Пример 2
# Улаз
# 8 3
# 2 5
# Излаз
# 6

import math

x1, y1 = map(int,input("Unesi poziciju kralja (od 1 do 8): ").split())
x2, y2 = map(int,input("Unesi koordinate dolaznog polja ( od 1 do 8): ").split())

# d= math.ceil(math.sqrt(pow(abs(x1-x2),2)+pow(abs(y1-y2),2))) - 1
d = max(abs(x1-x2),abs(y1-y2))

print(d)
