# Дата је кружна мета од n концентричних кругова полупречника од a cm до n·a cm. За погодак у унутрашњост
# најмањег круга добија се n поена, а за погодак у унутрашњост сваког следећег прстена добија се по поен мање.
# Написати програм којим се одређује колико се добија поена за погодак у тачку A(x, y) унутар мете.
#
# Улаз: У првом реду стандардног улаза налази се број кругова, цео број n (1 ≤ n ≤ 20), у другом ширина
# једног круга, реалан број a, у трећем реду x-координата тачке која је погођена, а у другом њена y-координата.
# Координате су реални бројеви, а тачка се сигурно налази унутар мете (x^2 + y^2)^(1/2) < n · a) и при томе није ни
# на једној од кружних линија које представљају гранцу кружних поља.
#
# Излаз: Једини ред стандардног излаза треба да садржи освојени број поена.
#
# Пример
# Улаз
# 10
# 1.0
# 1.2
# 5.3
# Излаз
# 5
import math

broj_krugova = int(input("Unesi broj krugova: "))
sirina_jednog_kruga = float(input("Unesi sirina jednog kruga: "))
x_koordinata = float(input("Unesi x koordinatu: "))
y_koordinata = float(input("Unesi y koordinatu: "))

poluprecnik = math.sqrt(pow(x_koordinata,2)+pow(y_koordinata,2))
rezultat = math.floor(poluprecnik)
print(rezultat)
