# У магацин се на n полица слажу гајбице са соковима. У сваку гајбицу може да стане k флаша сокова.
# Одредити најмањи укупан број гајбица потребан да се спакују све флаше из магацина, ако је познат број флаша
# сокова на свакој полици, при чему се у сваку гајбицу могу паковати искључиво флаше са једне полице.
#
# Улаз: У првој линији стандардног улаза налази се природан број n (1 ≤ n ≤ 100) који представља број
# полица у магацину. У другој је природан број k (5 ≤ k ≤ 30) који представља капацитет гајбице. У свакој
# од наредних n линија налази се природан број, из интервала [5, 500], који представља број флаша на свакој
# полици.
#
# Излаз: У једној линији стандардног излаза исписује се најмањи број употребљених гајбица.
# Пример
# Улаз
# 3
# 8
# 31
# 25
# 16
# Излаз
# 10

broj_polica = int(input("Unesi broj polica : " ))
broj_flasa_u_gajbici = int(input("Unesi kapacitet gajbice u broju flasa je: " ))
broj_gajbica = 0

for i in range(0,broj_polica):
    broj_flasa_na_polici = int(input("Unesi broj flasa na polici: "))
    broj_gajbica = broj_gajbica + (broj_flasa_na_polici + broj_flasa_u_gajbici-1)//broj_flasa_u_gajbici

print(broj_gajbica)
