# Деда Раде жели да упише својих четворо унука непливача у школу пливања. Инструктор му је рекао да је
# остао само један слободан термин, за који могу да се пријаве само деца виша од 110 сантиметара. Деда Раде
# не жели да раздваја унуке, па ће их уписати у школу пливања само ако сви испуњавају услов. Написати
# програм који одређује да ли деда Раде већ сада може да упише свих четворо унука у школу пливања.
#
# Улаз: Са стандардног улаза се уносе четири цела позитивна броја не већа од 180, сваки у посебном реду –
# висине деда Радетових унука.
#
# Излаз: На стандардни излаз исписати реч SVI ако је свако од четворо деце више од 110cm, а реч NIKO ако
# бар једно дете није више од 110 cm.
#
# Пример 1
# Улаз
# 131
# 111
# 128
# 117
# Излаз
# SVI
#
# Пример 2
# Улаз
# 131
# 110
# 128
# 117
# Излаз
# NIKO

a=int(input("Unesi visinu prvog unuka: "))
b=int(input("Unesi visinu drugog unuka: "))
c=int(input("Unesi visinu treceg unuka: "))
d=int(input("Unesi visinu cetvrtog unuka: "))

if a>110 and b>110 and c>110 and d>110:
    print("SVI")
else:
    print("NIKO")
