# UGNJEZDENO GRANANJE 
# Оцена на испиту одређује се на основу броја освојених поена (може се освојити између 0 и 100 поена). Сви
# студенти који су добили мање од 51 поен аутоматски падају испит и добијају оцену 5. Оцена 6 се добија за
# број поена већи или једнак од 51, а мањи од 61, оцена 7 за број поена већи или једнак од 61, а мањи од 71,
# оцена 8 за број поена већи или једнак од 71, а мањи од 81, оцена 9 за број поена већи или једнак од 81 а мањи
# од 91, а оцена 10 за број поена већи или једнак од 91.

# Улаз: Са стандардног улаза учитава се један цео број између 0 и 100 који представља број поена освојених
# на испиту.
#
# Излаз: На стандардни излаз исписати један цео број - оцену на испиту.
#
# Пример 1
# Улаз
# 73
# Излаз
# 8
#
# Пример 2
# Улаз
# 50
# Излаз
# 5
#
# Пример 3
# Улаз
# 51
# Излаз
# 6
#
# Пример 4
# Улаз
# 100
# Излаз
# 10

poeni= int(input("Unesi broj osovjenih poena: "))

if poeni >= 91:
    print("10")
elif poeni >= 81:
    print("9")
elif poeni >= 71:
    print("8")
elif poeni >= 61:
    print("7")
elif poeni >= 51:
    print("6")
else:
    print("5")
