# На такмичењу у скијашким скоковима поред удаљености коју скакач прескочи оцењује се и стил скакача. Пет
# судија оцењују стил скакача оценама од 0 до 20. Затим се од свих добијених оцена избришу једна најмања и
# једна највећа. Коначна оцена стила скакача рачуна се као просек преосталих оцена. Напиши програм којим
# се на основу оцена 5 судија одређује коначна оцена стила скакача.
# Улаз: У свакој од пет линија стандардног улаза налази се по једна оцена стила скакача (цео број између 0 и
# 20) коју је скијаш добио од пет судија.
# Излаз: Коначна оцена стила скакача приказана на две децимале.
#
# Пример
# Улаз
# 3
# 5
# 0
# 1
# 5
# Излаз
# 3.00

a1= int( input("Unesi prvu ocenu: "))
a2= int( input("Unesi drugu ocenu: "))
a3= int( input("Unesi trecu ocenu: "))
a4= int( input("Unesi cetvrtu ocenu: "))
a5= int( input("Unesi petu ocenu: "))

sum=a1+a2+a3+a4+a5
maksimum=max(a1,a2,a3,a4,a5)
minimum=min(a1,a2,a3,a4,a5)

prosecna_ocena=(sum-maksimum-minimum)/3
print("Prosecna ocena stila skijasa: "+"{:.2f}".format(prosecna_ocena))
