# Ана, Бранка, Весна и Гоца су четири сестре. Ана је виша од Бранке исто колико Бранка од Весне, као и Весна
# од Гоце. Ана и још две од сестара су биле на систематском прегледу, а четврта није. Одредити висину одсутне
# сестре ако су познате висине остале три.
#
# Улаз: У сваком од три реда стандардног улаза по један цео број x (85 ≤ x ≤ 200), висине трију сестара у
# центиметрима, међу којима је и Анина. Подаци су дати у произвољном редоследу, али тако да увек постоји
# јединствено целобројно решење.
#
# Излаз: Један цео број, висина четврте сестре у сантиметрима.
#
# Пример
# Улаз
# 176
# 146
# 156
# Излаз
# 166

v1=int(input("UNesi visinu prve sestreu cm (85-200): "))
v2=int(input("UNesi visinu druge sestreu cm (85-200): "))
v3=int(input("UNesi trece prve sestreu cm (85-200): "))

min1=min(v1,v2,v3)
max1=max(v1,v2,v3)

# nepoznata visina najnize devojke
if v2==(min1+max1)/2:
    v4=v3-(max1-min1)/2
# nepoznata visina trece devojke
elif v1-(max1-min1)/3==v2:
    v4=v2-(max1-min1)/3
# nepoznata visina druge devojke
else:
    v4=v1-(max1-min1)/3

print(int(v4))
