# Планинари се пeњу на врх планине чија је висина задата у метрима. Дању се могу попети према горе известан
# број метара, али током ноћи спавају, па се морају спустити за одређен број метара. Напишите програм који
# ће одредити колико дана треба планинарима да се попну до врха планине.
#
# Улаз: У прва три реда стандардног улаза налазе се природни бројеви G, D, H (1 ≤ D < G ≤ H ≤ 109) који
# редом означавају:
#       - G - висину метара коју планинари пређу дању пењући се навише,
#       - D - висину метара коју се планинари спусте ноћу,
#       - H - висина планине.
#
# Излаз: У први и једини ред стандардног излаза испишите број дана који ће проћи док планинари не стигну
# до врха.
#
# Пример
# Улаз
# 5
# 1
# 6
# Излаз
# 2

g = int(input("Unesi visinu u metrima za koju se planinari popnu za dana : "))
d = int(input("Unesi visinu u metrima za koju se planinari spuste da prenoce: "))
h = int(input("Unesi visinu u metrima planine: "))

brojDana = (h - d - 1) // (g - d) + 1
print("Broj dana: ",brojDana)
