# У програму за рад са графиком потребно је имплементирати интеракцију мишем са правоугаоницима нацртаним на екрану,
# чије су ивице паралелне координатним осама. Правоугаоник се мишем превлачи по екрану
# тако што се ухвати за ивицу, а да би се то лакше радило допуштена је толеранција од по 5 пиксела са сваке стране ивица
# правоугаоника. Када је миш близу ивице правоугаоника, ивица се исцртава другом бојом.
# Такође, када је миш унутар правоугаоника (а када миш није близу ивице) цео правоугаоник се боји неком
# трећом бојом. Напиши програм који за дату позицију миша и дати правоугаоник одређује да ли је миш близу ивице
# (рачунајући дату толеранцију), или је унутар правоугаоника, довољно далеко од ивице или је ван
# правоугаоника, довољно далеко од ивице.
#
# Улаз: Са стандардног улаза уноси се 6 целих бројева, сваки у посбној линији.
# • x, y - координате миша
# • x0, y0 - координате горњег левог темена правоугаоника
# • w, h - ширина и висина правоугаоника.
#
# Напомена: координата y у рачунарској графици расте одозго наниже.
#
# Излаз: На стандардни излаз исписати UNUTRA ако се миш налази унутар (проширених) ивица правоугаоника,
# SPOLJA ако је миш ван (проширених) ивица правоугаоника, тј. NA IVICI ако се налази на (проширеној) ивици
# правоугаоника.
#
# Пример 1
# Улаз
# 101
# 101
# 100
# 100
# 100
# 100
# Излаз
# NA IVICI
#
# Пример 2
# Улаз
# 106
# 106
# 100
# 100
# 50
# 100
# Излаз
# UNUTRA
#
# Пример 3
# Улаз
# 94
# 94
# 100
# 100
# 50
# 100
# Излаз
# SPOLJA

(x,y) = map(int,input("Unesi x,y koordinate misa: ").split())
(x0,y0) = map(int,input("Unesi x,y koordinate gornje leve tacke pravougaonika: ").split())
(w,h) = map(int,input("Unesi sirinu i visinu pravougaonika: ").split())

if (x > x0+5) and (x < x0+w-5)  and  (y >  y0+5)  and  (y < y0+h-5) :
    print("UNUTRA")
elif (x > x0-5) and (x < x0+5) and (y>y0-5) and (y<y0+5):
    print("NA IVICI")
else:
    print("SPOLJA")
