# RAD SA UGLOVIMA i njihovim pozicionim zapisima
#
# У математици се мера угла често изражава у радијанима. Угао чија је мера један радијан је онај угао чија је
# дужина лука једнака полупречнику. Напиши програм који за дати реалан број радијана израчуна најближи
# угао у степенима, минутима и секундама (целобројним).
# Улаз: Са стандардног улаза уноси се позитиван реалан број радијана.
# Излаз: На стандардни излаз исписати три цела броја stepeni (0 ≤ stepeni < 360), minuti (0 ≤ minuti <60) и sekundi (0 ≤ sekundi < 60), 
# раздвојена двотачкама, који представљају угао у степенима, минутима
# и секундама најближи датом углу у радијанима.

# Пример 1
# Улаз
# 1.57
# Излаз
# 89:57:15
# Пример 2
# Улаз
# 1000
# Излаз
# 55:46:46

import math

ugao_radijani= float(input("Unesi ugao u radijanima: "))
ugao_stepeni= ugao_radijani*180/math.pi

if (ugao_stepeni>360):
    ugao_stepeni=ugao_stepeni%360

h=int(ugao_stepeni)
m=int((ugao_stepeni-h)*60)
s=int((((ugao_stepeni-h)*60)*60)%60)

print(h,":",m,":",s)
