# Професор је обећао ученицима да ће број поена који су освојили на контролном задатку пропорционално увећати
# тако да Пера који је најбоље урадио и освојио 95 поена добије максимални број од 100 поена. Међутим,
# овом операцијом цели бројеви поена се претварају у реалне, могуће са пуно или чак бесконачно децимала.
# Зато је професор одлучио да увећани број поена заокружи са прецизношћу од пола поена. На пример, број
# 87.368 поена се заокружује на 87.5, 54.25 поена на 54.5, а 73.75 се заокружује на 74 поена. Приметимо да се
# када постоје две могућности заокружује увек навише (као у последња два примера). Написати програм који
# за унети број поена одређује његову вредност заокружену на овај начин.
#
# Улаз: Са стандардног улаза учитава се један цео број између 0 и 95 који представља број поена ученика пре
# скалирања.
#
# Излаз: На стандардни излаз исписати један реалан број који представља број поена ученика након скалирања.
#
# Пример 1
# Улаз
# 95
# Излаз
# 100
#
# Пример 2
# Улаз
# 84
# Излаз
# 88.5
#
# Пример 3
# Улаз
# 0
# Излаз
# 0

poeni = int(input("Unesi broj poena: "))
skalirani_nezaokruzeni = (poeni / 95.0) * 100.0;
skalirani_zaokruzeni = round(skalirani_nezaokruzeni * 2.0) / 2.0;
print(format(skalirani_zaokruzeni, '.1f'))
