# У једној приватној школи уведено је правило којим се одређује износ попуста који остварују ученици приликом уписа у
# наредну школску годину. Ученици са одличним успехом остварују попуст од 40% укупног
# износа школарине, са врлодобрим 20% а са добрим 10%. Такође, ученици који су освојили награду на неком
# од државних такмичења остварују попуст од 30% укупног износа школарине. Уколико неки ученик испуњава
# два критеријума за попуст примењује се критеријум по коме је попуст већи. На основу пуног износа школарине,
# просечне оцене ученика и информације о наградама са такмичења одредити износ који ученик треба
# да плати при упису у наредну школску годину.
#
# Улаз: У првој линији стандардног улаза налази се пун износ школарине (реалан број), у другој просечна
# оцена ученика (реалан број од 2.0 до 5.0) а у трећој 0 уколико ученик нема награду или 1 уколико је има.
#
# Излаз: Износ школарине коју ученик треба да плати (заокружен на најближи цео број) наводи се у једној
# линије стандардног излаза.
#
# Пример
# Улаз
# 4000
# 4.65
# 1
# Излаз
# 2400

osnovna_skolarina = int(input("Unesi cenu osnovne skolarine : "))
prosecna_ocena = float(input("Unesi prosecnu ocenu ucenika : "))
nagrada = int(input("Unesi da li ucenik ima nagradu 1-za DA  ili 0-za NE : "))

if (prosecna_ocena >= 4.50) :
    print(int(osnovna_skolarina * (1-0.4)))
elif (prosecna_ocena >= 3.50 and nagrada == 1) :
    print(int(osnovna_skolarina * (1-0.3)))
elif (prosecna_ocena >= 3.50 and nagrada == 0) :
    print(int(osnovna_skolarina * (1-0.2)))
elif (prosecna_ocena >= 2.50 and nagrada == 1) :
    print(int(osnovna_skolarina * (1-0.3)))
elif (prosecna_ocena >= 2.50 and nagrada == 0) :
    print(int(osnovna_skolarina * (1-0.1)))
else:
    print(osnovna_skolarina)
