# Порез је одређен на следећи начин. Првих 60 000 динара бруто плате се не опорезује. На део бруто плате
# између 60 000 и 100 000 динара, плаћа се 20% пореза док се на део бруто плате преко 100 000 динара плаћа
# порез од 25%. Напиши програм који за унету бруто плату (плату пре одбијања пореза) израчунава нето плату
# (плату после одбијања пореза).
#
# Улаз: Са стандардног улаза се учитава један реалан број – износ бруто плате.
#
# Излаз: На стандардни излаз исписује се један реалан број – износ нето плате, заокружен на две децимале.
#
# Пример
# Улаз
# 100000
# Излаз
# 92000.00

bruto_plata = int(input("Unesi iznos bruto plate: "))

if bruto_plata > 100000 :
    neto_plata = bruto_plata-(bruto_plata-60000)*0.25
elif bruto_plata > 60000 :
    neto_plata = bruto_plata-(bruto_plata-60000)*0.20
else:
    neto_plata = bruto_plata

print(neto_plata)
