# Милица је објавила три статуса на друштвеној мрежи. Напиши програм који проверава да ли је неки од тих
# статуса написан у школи (Милица је била у школи од 8:30 до 13:50, укључујући и та времена).
#
# Улаз: Са стандардног улаза учитавају се три времена објаве статуса (свако време у посебном реду). За сваки
# статус се учитавају сати и минути (два цела броја раздвојена размаком).
#
# Излаз: На стандардни излаз написати da ако је неки статус објављен током боравка у школи тј. ne у супротном.
#
# Пример 1
# Улаз
# 14 23
# 17 19
# 22 14
# Излаз
# ne
#
# Пример 2
# Улаз
# 7 23
# 8 45
# 15 20
# Излаз
# da

(s1,m1) = map(int,input("Unesi vreme prvog statusa u formatu hh:mm ").split(":"))
(s2,m2) = map(int,input("Unesi vreme drugog statusa u formatu hh:mm ").split(":"))
(s3,m3) = map(int,input("Unesi vreme treceg statusa u formatu hh:mm ").split(":"))

if ((s1<8 and m1<30) or (s1>13 and m1>50)) and ((s2<8 and m2<30) or (s2>13 and m2>50)) and ((s3<8 and m3<30) or (s3>13 and m3>50)) :
    print("ne")
else:
    print("da")
