# Мирко је мали програмер који покушава да испрограмира игрицу судоку. Близу је да заврши, али му је
# потребна мала помоћ. Смислио је да корисник мишем бира квадрат у који ће уписати број. Поље се састоји
# од 81 квадратића распоређеног у 9 врста и 9 колона и организованог у 9 већих квадрата (као на слици). Сваки
# квадратић је димензије 30 пута 30 пиксела (укупно поље је димензије 270 пута 270 пиксела). Познат је
# положај пиксела на који је кликнуто мишем. Положај је одређен редним бројевима (координатама) тог
# пиксела по хоризонтали и по вертикали, рачунајући од доњег левог угла поља (пиксели се и по хоризонтали
# и по вертикали броје од 1 до 270). Потребно је исписати редни број врсте, колоне и већег квадрата у којем
# се налази пиксел на који је кликнуто (врсте се броје од 1 до 9 одоздо навише, колоне од 1 до 9 слева надесно,
# а квадрати по врстама од доњег левог угла, како је обележено на слици).
#
# Улаз: Са улаза се учитавају два цела броја x и y (1 ≤ x, y ≤ 270) које представљају координате пиксела на
# који је кликнуто.
#
# Излаз: На стандардни излаз исписати три броја, сваки посебном реду: редни број врсте (од 1 до 9), редни
# број колоне (од 1 до 9) и редни број квадрата (од 1 до 9).
#
# Пример 1
# Улаз
# 128
# 230
# Излаз
# 8
# 5
# 8
# Пример 2
# Улаз
# 180
# 180
# Излаз
# 6
# 6
# 5
# Пример 3
# Улаз
# 181
# 181
# Излаз
# 7
# 7
# 9

x = int(input("Unesi koordinatu x : " ))
y = int(input("Unesi koordinatu y : " ))

x1 = (x+30-1)//30
y1 = (y+30-1)//30
z1 = (x+90-1)//90+((y+90-1)//90-1)*3

print("Redni broj vrste: ",y1)
print("Redni broj kolone: ",x1)
print("Redni broj polja: ",z1)
