# Библиотека за цртање омогућава цртање правоугаоника тако што се задају прво координате његовог горњег
# левог темена, а затим координате његовог доњег десног темена. Нама су познате координате крајњих тачака
# неке од његових дијагонала. Напиши програм који на основу тих координата одређује координате потребне
# за цртање. Координатни систем је организован тако да x-координата расте са лева на десно, док y-координата
# расте одозго наниже.
#
# Улаз: У првом реду стандардног улаза налазе се координате темена дијагонале (свако теме у посебном реду,
# при чему су координате раздвојене размаком).
#
# Излаз: На стандардни излаз исписати координате горњег левог и доњег десног темена (свако теме у посебном
# реду, при чему су координате раздвојене размаком).
#
# Пример
# Улаз
# 40 80
# 90 30
# Излаз
# 40 30
# 90 80

x1 , y1 = map(int,input("Unesi koordinate prvog temena: ").split())
x2 , y2 = map(int,input("Unesi koordinate drugog temena: ").split())

xmax= max(x1,x2)
xmin= min(x1,x2)
ymax= max(y1,y2)
ymin= min(y1,y2)

print ("Gornje levo teme: "+str(xmin)+ " " + str(ymin))
print ("Donje desno teme: "+str(xmax)+ " " + str(ymax))
