# Дете броји у игри жмурке 5, 10, 15, . . . , 100, али пошто не зна бројеве веће од 100, после 100 оно креће да
# броји из почетка. Који је број рекао у n-том кораку?
#
# Улаз: Са стандардног улаза учитава се један позитиван цео број n.
#
# Излаз: На стандардни излаз исписује се број који дете изговара у n-том кораку.
#
# Пример 1
# Улаз
# 5
# Излаз
# 25
#
# Пример 2
# Улаз
# 1234
# Излаз
# 70

n= int(input("Unesi n-ti broj u nabrajanju na kome dete staje sa brojanjem: "))

print("Trazeni broj na kojem staje brojalica za zmurke je: ", (n*5)%100)
